docs/AlgrithmAnalysis/AlgorithmAnalysis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-26 Tue 08:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yubao" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org772d585">1. Algorithm</a>
<ul>
<li><a href="#orgf463e47">1.1. Sorting Overview</a>
<ul>
<li><a href="#org4b9f906">1.1.1. Time Complexities of all Sorting Algorithms</a></li>
</ul>
</li>
<li><a href="#org1704d1b">1.2. Common Insertion Sort</a>
<ul>
<li><a href="#org6c08a19">1.2.1. Algorithm</a></li>
<li><a href="#orge4ce2f8">1.2.2. How to implement Insertion Sort for Linked List?</a></li>
<li><a href="#orgf620ef2">1.2.3. Complexity Analysis</a></li>
</ul>
</li>
<li><a href="#orgd14ca12">1.3. Binary Insertionsort</a>
<ul>
<li><a href="#org2824b02">1.3.1. What is Binary Insertion Sort?</a></li>
</ul>
</li>
<li><a href="#orgc529d46">1.4. Fibonacci sequence</a></li>
</ul>
</li>
<li><a href="#orgd3dfa93">2. Reference</a></li>
</ul>
</div>
</div>
<p>
\usepackage{amsmath}
</p>
<div id="outline-container-org772d585" class="outline-2">
<h2 id="org772d585"><span class="section-number-2">1</span> Algorithm</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf463e47" class="outline-3">
<h3 id="orgf463e47"><span class="section-number-3">1.1</span> Sorting Overview</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org4b9f906" class="outline-4">
<h4 id="org4b9f906"><span class="section-number-4">1.1.1</span> Time Complexities of all Sorting Algorithms</h4>
<div class="outline-text-4" id="text-1-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Best</td>
<td class="org-left">Average</td>
<td class="org-left">Worst</td>
</tr>

<tr>
<td class="org-left">Selection Sort</td>
<td class="org-left">Ω(n<sup>2</sup>)</td>
<td class="org-left">θ(n<sup>2</sup>)</td>
<td class="org-left">O(n<sup>2</sup>)</td>
</tr>

<tr>
<td class="org-left">Bubble Sort</td>
<td class="org-left">Ω(n)</td>
<td class="org-left">θ(n<sup>2</sup>)</td>
<td class="org-left">O(n<sup>2</sup>)</td>
</tr>

<tr>
<td class="org-left">Insertion Sort</td>
<td class="org-left">Ω(n)</td>
<td class="org-left">θ(n<sup>2</sup>)</td>
<td class="org-left">O(n<sup>2</sup>)</td>
</tr>

<tr>
<td class="org-left">Heap Sort</td>
<td class="org-left">Ω(n log(n))</td>
<td class="org-left">θ(n log(n))</td>
<td class="org-left">O(n log(n))</td>
</tr>

<tr>
<td class="org-left">Quick Sort</td>
<td class="org-left">Ω(n log(n))</td>
<td class="org-left">θ(n log(n))</td>
<td class="org-left">O(n<sup>2</sup>)</td>
</tr>

<tr>
<td class="org-left">Merge Sort</td>
<td class="org-left">Ω(n log(n))</td>
<td class="org-left">θ(n log(n))</td>
<td class="org-left">O(n log(n))</td>
</tr>

<tr>
<td class="org-left">Bucket Sort</td>
<td class="org-left">Ω(n+k)</td>
<td class="org-left">θ(n+k)</td>
<td class="org-left">O(n<sup>2</sup>)</td>
</tr>

<tr>
<td class="org-left">Radix Sort</td>
<td class="org-left">Ω(nk)</td>
<td class="org-left">θ(nk)</td>
<td class="org-left">O(nk)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org1704d1b" class="outline-3">
<h3 id="org1704d1b"><span class="section-number-3">1.2</span> Common Insertion Sort</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org6c08a19" class="outline-4">
<h4 id="org6c08a19"><span class="section-number-4">1.2.1</span> Algorithm</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Sort an arr[] of size n</span>
insertionSort<span style="color: #4f97d7;">(</span>arr, n<span style="color: #4f97d7;">)</span>
Loop <span style="color: #ce537a; font-weight: bold;">from</span> <span style="color: #7590db;">i</span> = <span style="color: #a45bad;">1</span> to n-<span style="color: #a45bad;">1</span>.
&#8230;&#8230;a<span style="color: #e0211d; text-decoration: overline;">)</span> Pick <span style="color: #ce537a; font-weight: bold;">element</span> <span style="color: #7590db;">arr</span><span style="color: #e0211d; text-decoration: overline;">[</span>i<span style="color: #e0211d; text-decoration: overline;">]</span> <span style="color: #4f97d7; font-weight: bold;">and</span> insert it into sorted sequence arr<span style="color: #e0211d; text-decoration: overline;">[</span>0&#8230;i-<span style="color: #a45bad;">1</span><span style="color: #e0211d; text-decoration: overline;">]</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">InsertionSort</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">ElementType</span> <span style="color: #7590db;">arr</span><span style="color: #bc6ec5;">[]</span>,<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">ElementType</span> <span style="color: #7590db;">key</span>,<span style="color: #7590db;">i</span>,<span style="color: #7590db;">j</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span><span style="color: #bc6ec5;">(</span> i=<span style="color: #a45bad;">1</span>; i&lt; n; i++<span style="color: #bc6ec5;">)</span><span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">unsorted subarray, i:1-&gt;N-1</span>
  <span style="color: #bc6ec5;">{</span>
    key=arr<span style="color: #2d9574;">[</span>i<span style="color: #2d9574;">]</span>;

    <span style="color: #4f97d7; font-weight: bold;">for</span><span style="color: #2d9574;">(</span> j=i-<span style="color: #a45bad;">1</span>; j&gt;=<span style="color: #a45bad;">0</span> &amp;&amp; key&lt;=arr<span style="color: #67b11d;">[</span>j<span style="color: #67b11d;">]</span>;j--<span style="color: #2d9574;">)</span><span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">sorted subarray, j:i-&gt;0</span>
    <span style="color: #2d9574;">{</span>
      arr<span style="color: #67b11d;">[</span>j+<span style="color: #a45bad;">1</span><span style="color: #67b11d;">]</span>=arr<span style="color: #67b11d;">[</span>j<span style="color: #67b11d;">]</span>;
    <span style="color: #2d9574;">}</span>
    arr<span style="color: #2d9574;">[</span>j+<span style="color: #a45bad;">1</span><span style="color: #2d9574;">]</span>=key;
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">insertionSort</span><span style="color: #4f97d7;">(</span>arr<span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span>, <span style="color: #4f97d7;">len</span><span style="color: #bc6ec5;">(</span>arr<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #7590db;">key</span>=arr<span style="color: #4f97d7;">[</span>i<span style="color: #4f97d7;">]</span>
        <span style="color: #7590db;">j</span>=i-<span style="color: #a45bad;">1</span>
    <span style="color: #4f97d7; font-weight: bold;">while</span> j&gt;=<span style="color: #a45bad;">0</span> <span style="color: #4f97d7; font-weight: bold;">and</span> key&lt;arr<span style="color: #4f97d7;">[</span>j<span style="color: #4f97d7;">]</span>:
        <span style="color: #7590db;">arr</span><span style="color: #4f97d7;">[</span>j+<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">]</span>=arr<span style="color: #4f97d7;">[</span>j<span style="color: #4f97d7;">]</span>
        <span style="color: #7590db;">j</span>-=<span style="color: #a45bad;">1</span>
    <span style="color: #7590db;">arr</span><span style="color: #4f97d7;">[</span>j+<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">]</span>=key
</pre>
</div>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">InsertionSort</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">sort</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">arr</span><span style="color: #2d9574;">[]</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">{</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span>=arr.length;
    <span style="color: #4f97d7; font-weight: bold;">for</span><span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>=<span style="color: #a45bad;">1</span>;i&lt;<span style="color: #ce537a; font-weight: bold;">n</span>;++i<span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">{</span>
      <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">key</span>=arr<span style="color: #67b11d;">[</span>i<span style="color: #67b11d;">]</span>;
      <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span>=i-<span style="color: #a45bad;">1</span>;
      <span style="color: #4f97d7; font-weight: bold;">while</span><span style="color: #67b11d;">(</span>j&gt;=<span style="color: #a45bad;">0</span>&amp;&amp; arr<span style="color: #b1951d;">[</span>j<span style="color: #b1951d;">]</span>&gt;key<span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">{</span>
        arr<span style="color: #b1951d;">[</span>j+<span style="color: #a45bad;">1</span><span style="color: #b1951d;">]</span>=arr<span style="color: #b1951d;">[</span>j<span style="color: #b1951d;">]</span>;
        j=j-<span style="color: #a45bad;">1</span>;
      <span style="color: #67b11d;">}</span>
      arr<span style="color: #67b11d;">[</span>j+<span style="color: #a45bad;">1</span><span style="color: #67b11d;">]</span>=key;
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge4ce2f8" class="outline-4">
<h4 id="orge4ce2f8"><span class="section-number-4">1.2.2</span> How to implement Insertion Sort for Linked List?</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Below is simple insertion sort algorithm for linked list.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #a45bad;">1</span><span style="color: #e0211d; text-decoration: overline;">)</span> Create an <span style="color: #ce537a; font-weight: bold;">empty</span> <span style="color: #7590db;">sorted</span> <span style="color: #e0211d; text-decoration: overline;">(</span><span style="color: #4f97d7; font-weight: bold;">or</span> result<span style="color: #e0211d; text-decoration: overline;">)</span> list
<span style="color: #a45bad;">2</span><span style="color: #e0211d; text-decoration: overline;">)</span> Traverse the <span style="color: #ce537a; font-weight: bold;">given</span> <span style="color: #7590db;">list</span>, <span style="color: #4f97d7; font-weight: bold;">do</span> following <span style="color: #4f97d7; font-weight: bold;">for</span> every node.
......a<span style="color: #e0211d; text-decoration: overline;">)</span> Insert current node in sorted way <span style="color: #ce537a; font-weight: bold;">in</span> <span style="color: #7590db;">sorted</span> <span style="color: #4f97d7; font-weight: bold;">or</span> result list.
<span style="color: #a45bad;">3</span><span style="color: #e0211d; text-decoration: overline;">)</span> Change head of <span style="color: #ce537a; font-weight: bold;">given</span> linked list to head <span style="color: #ce537a; font-weight: bold;">of</span> <span style="color: #7590db;">sorted</span> <span style="color: #e0211d; text-decoration: overline;">(</span><span style="color: #4f97d7; font-weight: bold;">or</span> result<span style="color: #e0211d; text-decoration: overline;">)</span> list. 
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf620ef2" class="outline-4">
<h4 id="orgf620ef2"><span class="section-number-4">1.2.3</span> Complexity Analysis</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Time Complexity: O(n*n)
</p>

<p>
Auxiliary Space: O(1)
</p>
</div>
</div>
</div>

<div id="outline-container-orgd14ca12" class="outline-3">
<h3 id="orgd14ca12"><span class="section-number-3">1.3</span> Binary Insertionsort</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org2824b02" class="outline-4">
<h4 id="org2824b02"><span class="section-number-4">1.3.1</span> What is Binary Insertion Sort?</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
We can use binary search to reduce the number of comparisons in normal insertion sort. Binary Insertion Sort find use binary search to find the proper location to insert the selected item at each iteration. In normal insertion, sort it takes O(i) (at ith iteration) in worst case. we can reduce it to O(logi) by using binary search. The algorithm as a whole still has a running worst case running time of O(n2) because of the series of swaps required for each insertion. Refer <a href="http://www.geeksforgeeks.org/binary-insertion-sort/">this</a> for implementation.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc529d46" class="outline-3">
<h3 id="orgc529d46"><span class="section-number-3">1.4</span> Fibonacci sequence</h3>
<div class="outline-text-3" id="text-1-4">
\begin{equation}
a_1 = 1 \\
a_2 = 1 \\
a_{n+2} = a_n + a_{n+1};
\end{equation}

\begin{bmatrix}
a_n \\
a_n+1
\end{bmatrix}

<p>
=
</p>

\begin{bmatrix}
0 & 1 \\
1 & 1
\end{bmatrix}^{n-1}

*

\begin{bmatrix}
a_1 \\
a_2 
\end{bmatrix}
<div class="org-src-container">
<pre class="src src-C"><span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;"> Fibnacci: 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, ...</span>
<span style="color: #2aa1ae; background-color: #292e34;"> Assume a(1)=1; a(2)=1; a(n+2)= a(n) + a(n+1)</span>
<span style="color: #2aa1ae; background-color: #292e34;"> Please Calculate a(n)</span>
<span style="color: #2aa1ae; background-color: #292e34;"> Algorithm:</span>
<span style="color: #2aa1ae; background-color: #292e34;"> (a_n; a_n+1) = (0 1; 1 1)^(n-1) * (a_1 ; a_2)</span>
<span style="color: #2aa1ae; background-color: #292e34;">*/</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">fabonacci</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span><span style="color: #bc6ec5;">(</span>n&lt;=<span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">1</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">current</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">]</span>=<span style="color: #bc6ec5;">{</span><span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">}</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">next</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">]</span>=<span style="color: #bc6ec5;">{</span><span style="color: #a45bad;">0</span>,<span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">}</span>;
    <span style="color: #4f97d7; font-weight: bold;">for</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>=<span style="color: #a45bad;">0</span>;i&lt;n-<span style="color: #a45bad;">1</span>;i++<span style="color: #bc6ec5;">)</span>
    <span style="color: #bc6ec5;">{</span>
        next<span style="color: #2d9574;">[</span><span style="color: #a45bad;">0</span><span style="color: #2d9574;">]</span>=<span style="color: #a45bad;">0</span>*current<span style="color: #2d9574;">[</span><span style="color: #a45bad;">0</span><span style="color: #2d9574;">]</span>+<span style="color: #a45bad;">1</span>*current<span style="color: #2d9574;">[</span><span style="color: #a45bad;">1</span><span style="color: #2d9574;">]</span>;  
        next<span style="color: #2d9574;">[</span><span style="color: #a45bad;">1</span><span style="color: #2d9574;">]</span>=<span style="color: #a45bad;">1</span>*current<span style="color: #2d9574;">[</span><span style="color: #a45bad;">0</span><span style="color: #2d9574;">]</span>+<span style="color: #a45bad;">1</span>*current<span style="color: #2d9574;">[</span><span style="color: #a45bad;">1</span><span style="color: #2d9574;">]</span>;
        current<span style="color: #2d9574;">[</span><span style="color: #a45bad;">0</span><span style="color: #2d9574;">]</span>=next<span style="color: #2d9574;">[</span><span style="color: #a45bad;">0</span><span style="color: #2d9574;">]</span>;
        current<span style="color: #2d9574;">[</span><span style="color: #a45bad;">1</span><span style="color: #2d9574;">]</span>=next<span style="color: #2d9574;">[</span><span style="color: #a45bad;">1</span><span style="color: #2d9574;">]</span>;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> current<span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">]</span>;   
<span style="color: #4f97d7;">}</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span><span style="color: #bc6ec5;">[]</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
    printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"n=3, result= %d \n"</span>,fabonacci<span style="color: #2d9574;">(</span><span style="color: #a45bad;">3</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
    printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"n=6, result= %d \n"</span>,fabonacci<span style="color: #2d9574;">(</span><span style="color: #a45bad;">6</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd3dfa93" class="outline-2">
<h2 id="orgd3dfa93"><span class="section-number-2">2</span> Reference</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="http://interactivepython.org/courselib/static/pythonds/index.html">Problem Solving with Algorithms and Data Structures using Python</a></li>
<li><a href="https://www.khanacademy.org/computing/computer-science/algorithms/">khanacademy-algorithms</a></li>
<li><a href="http://www.geeksforgeeks.org/insertion-sort/">geeksforgeeks insertion sort</a></li>
<li><a href="https://www.hackerearth.com/zh/practice/notes/sorting-and-searching-algorithms-time-complexities-cheat-sheet/">TimeComplexity Cheat Sheet for sorting and searching</a></li>
<li>Youtube MIT vedio:
There are three courses to be taken in order. Intro, Design &amp; Analysis, and Advanced. Here are the YouTube playlists for each: 
<ul class="org-ul">
<li>Intro: <a href="https://www.youtube.com/playlist?list=PLUl4u3cNGP61Oq3tWYp6V_F-5jb5L2iHb">https://www.youtube.com/playlist?list=PLUl4u3cNGP61Oq3tWYp6V_F-5jb5L2iHb</a></li>
<li>Design: <a href="https://www.youtube.com/playlist?list=PLUl4u3cNGP6317WaSNfmCvGym2ucw3oGp">https://www.youtube.com/playlist?list=PLUl4u3cNGP6317WaSNfmCvGym2ucw3oGp</a></li>
<li>Advanced: <a href="https://www.youtube.com/playlist?list=PL6ogFv-ieghdoGKGg2Bik3Gl1glBTEu8c">https://www.youtube.com/playlist?list=PL6ogFv-ieghdoGKGg2Bik3Gl1glBTEu8c</a></li>
<li>View the complete course at: <a href="http://ocw.mit.edu/6-046JF05">http://ocw.mit.edu/6-046JF05</a></li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yubao</p>
<p class="date">Created: 2017-12-26 Tue 08:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
